{
  "buildings":[{
    "query": [
      "Where is the B1 Activity Building located?",
      "Can you tell me how to get to the B1 Activity Building?",
      "What's the nearest landmark to the B1 Activity Building?"
    ],
    "intent": "building_location",
    "entities": [
      {"B1 Activity Building":"building"}
    ]
  },
  {
    "query": [
      "Where is the A Zone Teaching Buildings located?",
      "How do I get to the A Zone Teaching Buildings from the main gate?",
      "Can you show me the way to the A Zone Teaching Buildings?"
    ],
    "intent": "building_location",
    "entities": [
      {"A Zone Teaching Buildings": "building"}
    ]
  },
  {
    "query": [
      "Where is Block LY located on campus?",
      "Can you tell me how to get to Block LY Buildings?",
      "What is the nearest landmark to Block LY Buildings?"
    ],
    "intent": "building_location",
    "entities": [
      {"Block LY Buildings": "building"}
    ]
  },
  {
    "query": ["Where is Block D located on campus?", "Can you tell me how to get to Block D?", "What's the nearest landmark to Block D?"],
    "intent": "building_location",
    "entities": [
      {"Block D Buildings":"building"}
    ]
  },
  {
    "query": [
      "Where is the XMUM IAEC building located?",
      "Can you tell me how to get to the XMUM IAEC building?",
      "What is the nearest landmark to the XMUM IAEC building?"
    ],
    "intent": "building_location",
    "entities": [
      {"XMUM IAEC": "building"}
    ]
  },
  {
    "query": [
      "What facilities are included in the B1 Activity Building?",
      "Can you list the amenities available in B1 Activity Building?",
      "Does the B1 Activity Building have a gym or study rooms?"
    ],
    "intent": "building_include",
    "entities": [
      {"B1 Activity Building": "building"}
    ]
  },
  {
    "query": [
      "What departments are located in A Zone Teaching Buildings?",
      "Can you list the facilities available in A Zone Teaching Buildings?",
      "Which classrooms are included in A Zone Teaching Buildings?"
    ],
    "intent": "building_include",
    "entities": [
      {"A Zone Teaching Buildings": "building"}
    ]
  },
  {
    "query": [
      "What facilities are included in Block LY Buildings?",
      "Can you list the amenities available in Block LY Buildings?",
      "Does Block LY Buildings have a cafeteria?"
    ],
    "intent": "building_include",
    "entities": [
      {"Block LY Buildings": "building"}
    ]
  },
  {
    "query": [
      "What facilities are included in Block D Buildings?",
      "Can you list the amenities available in Block D Buildings?",
      "Does Block D Buildings have a study room?"
    ],
    "intent": "building_include",
    "entities": [
      {"Block D Buildings": "building"}
    ]
  },
  {
    "query": [
      "What facilities are included in the XMUM IAEC building?",
      "Does the XMUM IAEC building have a library?",
      "Are there any labs in the XMUM IAEC building?"
    ],
    "intent": "building_include",
    "entities": [
      {"XMUM IAEC": "building"}
    ]
  }]
}